// 这是秦九韶发明的大衍求一术求解乘法逆元方法的算法实现
// 本质上可以看作是 exgcd 的迭代实现，效率较高，可以通过洛谷线性递推逆元的模板 
// HRJ created on 2021/4/3
// ax = 1 (mod p)
int dayan(int x,int p) {
	a[0][1]=x,a[1][1]=p;
	a[0][0]=1,a[1][0]=0;
	int sta=1;
	while(a[0][1]!=1 && a[1][1]!=1 && a[0][1]!=0 && a[1][1]!=0) {
		if(sta==1) {
			int s=a[1][1]/a[0][1],y=a[1][1]%a[0][1];
			a[1][0]+=s*a[0][0],a[1][1]=y;
			sta=0;
		} else {
			int s=a[0][1]/a[1][1],y=a[0][1]%a[1][1];
			a[0][0]+=s*a[1][0],a[0][1]=y;
			sta=1;
		}
	}
	if(a[0][1]==1) return a[0][0];
	else if(a[1][1]==1) return -a[1][0];
	else if(a[1][1]==0) return a[0][0];
	else return -a[1][0];
}
